Data Import

In [215]:
import numpy as np
import pandas as pd

path = r'C:\Users\ghoas\OneDrive\Desktop\excel sheets\project\house_data.csv'
data = pd.read_csv(path)
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [216]:
data.shape

(13320, 9)

In [217]:
data.isna().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [218]:
data.groupby('area_type')['area_type'].agg('count')

area_type
Built-up  Area          2418
Carpet  Area              87
Plot  Area              2025
Super built-up  Area    8790
Name: area_type, dtype: int64

Eliminate Junks

In [219]:
#DROP 
data = data.drop(['availability', 'society','balcony','availability'],axis='columns')

In [220]:
data.isna().sum()

area_type      0
location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [221]:
#drop na

data2= data.dropna()
data2.isna().sum()

area_type     0
location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [222]:
data['size'].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', nan, '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

Ouliers Detection and elimination

In [223]:
# lets solve thsi datas create new col BHK and bedroom

data2['bhk']= data2['size'].apply(lambda x : int(x.split(' ')[0])) # this gives you 2 in 2 BHK and so on which will be in strting, to convert to integer we have use int

C:\Users\ghoas\AppData\Local\Temp\ipykernel_15784\3344545184.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data2['bhk']= data2['size'].apply(lambda x : int(x.split(' ')[0])) # this gives you 2 in 2 BHK and so on which will be in strting, to convert to integer we have use int

In [224]:
data2.head()

,area_type,location,size,total_sqft,bath,price,bhk
0,Super built-up Area,Electronic City Phase II,2 BHK,1056,2.0,39.07,2
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4
2,Built-up Area,Uttarahalli,3 BHK,1440,2.0,62.00,3
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3
4,Super built-up Area,Kothanur,2 BHK,1200,2.0,51.00,2

In [225]:
data2['bhk'].unique()

array([ 2,  4,  3,  6,  1,  8,  7,  5, 11,  9, 27, 10, 19, 16, 43, 14, 12,
       13, 18])

In [226]:
data2[data2.bhk>= 20] #well I think these should be removed as this is unnatural datas

,area_type,location,size,total_sqft,bath,price,bhk
1718,Super built-up Area,2Electronic City Phase II,27 BHK,8000,27.0,230.0,27
4684,Plot Area,Munnekollal,43 Bedroom,2400,40.0,660.0,43

In [227]:
data2.total_sqft.unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [228]:
#in the table thers is a ranges in total_squart col so fetch it first
#not only ranges but also data like 34.5Sq. Meter , 4125Perch

def isFloat(x):
    try:
        float(x)
    except:
        return False
    else:
        return True



data2[~data2['total_sqft'].apply(isFloat)]

,area_type,location,size,total_sqft,bath,price,bhk
30,Super built-up Area,Yelahanka,4 BHK,2100 - 2850,4.0,186.000,4
122,Super built-up Area,Hebbal,4 BHK,3067 - 8156,4.0,477.000,4
137,Super built-up Area,8th Phase JP Nagar,2 BHK,1042 - 1105,2.0,54.005,2
165,Super built-up Area,Sarjapur,2 BHK,1145 - 1340,2.0,43.490,2
188,Super built-up Area,KR Puram,2 BHK,1015 - 1540,2.0,56.800,2
...,...,...,...,...,...,...,...
12975,Super built-up Area,Whitefield,2 BHK,850 - 1060,2.0,38.190,2
12990,Super built-up Area,Talaghattapura,3 BHK,1804 - 2273,3.0,122.000,3
13059,Super built-up Area,Harlur,2 BHK,1200 - 1470,2.0,72.760,2
13265,Super built-up Area,Hoodi,2 BHK,1133 - 1384,2.0,59.135,2
13299,Super built-up Area,Whitefield,4 BHK,2830 - 2882,5.0,154.500,4

In [229]:
#logic : if range replace with mean value , if not return as it is , if any other like 25sqft return NONE

def cal_total_sqft(x):
    token = x.split('-')
    if(len(token) == 2):
       return ((float(token[0]) + float(token[1]))/2)
    try:
         return float(x)
    except:
        return None

In [230]:
cal_total_sqft('123')

123.0

In [231]:
cal_total_sqft('2830 - 2882') #return mean value

2856.0

In [232]:
cal_total_sqft('34.5sq. meter') #return nothing basically

In [233]:
data3= data2.copy()
data3['total_sqft']= data3['total_sqft'].apply(cal_total_sqft)
data3.head()

,area_type,location,size,total_sqft,bath,price,bhk
0,Super built-up Area,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4
2,Built-up Area,Uttarahalli,3 BHK,1440.0,2.0,62.00,3
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3
4,Super built-up Area,Kothanur,2 BHK,1200.0,2.0,51.00,2

In [234]:
data3[~data3['total_sqft'].apply(isFloat)] #nothing left to clean in toal sqrtft

Empty DataFrame
Columns: [area_type, location, size, total_sqft, bath, price, bhk]
Index: []

In [235]:
data3.loc[30]

area_type     Super built-up  Area
location                 Yelahanka
size                         4 BHK
total_sqft                  2475.0
bath                           4.0
price                        186.0
bhk                              4
Name: 30, dtype: object

Feature Engineering

In [236]:
data4= data3.copy()

In [237]:
#create price per sq ft coloumn

data4['price_sqft']= data4.price*1000000/data4.total_sqft
data4.head()

,area_type,location,size,total_sqft,bath,price,bhk,price_sqft
0,Super built-up Area,Electronic City Phase II,2 BHK,1056.0,2.0,39.07,2,36998.106061
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600.0,5.0,120.00,4,46153.846154
2,Built-up Area,Uttarahalli,3 BHK,1440.0,2.0,62.00,3,43055.555556
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521.0,3.0,95.00,3,62458.908613
4,Super built-up Area,Kothanur,2 BHK,1200.0,2.0,51.00,2,42500.000000

In [238]:
#lets explre location columns

len(data4.location.unique())

1304

In [239]:
name= "Anish Gho Shrestha     "
name.strip()

'Anish Gho Shrestha'

In [240]:
#reduce the dimentions

#figure out how many datapoints are availble for location

#t know if there is any space in the end of the location and manage it 
data4['location'] = data4.location.apply(lambda x : x.strip())
location_stats = data4.groupby('location')['location'].agg('count').sort_values(ascending=False)
location_stats.head(40)

location
Whitefield                  535
Sarjapur  Road              392
Electronic City             304
Kanakpura Road              266
Thanisandra                 236
Yelahanka                   210
Uttarahalli                 186
Hebbal                      176
Marathahalli                175
Raja Rajeshwari Nagar       171
Bannerghatta Road           152
Hennur Road                 150
7th Phase JP Nagar          149
Haralur Road                141
Electronic City Phase II    131
Rajaji Nagar                106
Chandapura                   98
Bellandur                    96
Hoodi                        88
KR Puram                     88
Electronics City Phase 1     87
Yeshwanthpur                 85
Begur Road                   84
Sarjapur                     81
Harlur                       79
Kasavanhalli                 79
Hormavu                      74
Banashankari                 74
Ramamurthy Nagar             73
Kengeri                      73
Hosa Road                    72
Koramangala                  72
Old Madras Road              70
Varthur                      70
Jakkur                       68
JP Nagar                     67
Kothanur                     66
Kaggadasapura                64
Nagarbhavi                   63
Thigalarapalya               62
Name: location, dtype: int64

In [241]:
#know how many location stat samller than 10

len(location_stats[location_stats <=10])
loc_small_10 = location_stats[location_stats <=10]
loc_small_10

location
Kalkere                               10
Sadashiva Nagar                       10
BTM 1st Stage                         10
Basapura                              10
Gunjur Palya                          10
                                      ..
poornaprajna layout                    1
pavitra paradise                       1
near Ramanashree California resort     1
mvj engineering college                1
1Kasavanhalli                          1
Name: location, Length: 1052, dtype: int64

In [242]:
len(data4.location.unique())

1293

In [ ]:
#replacing he locatiionless than 10 as others 

data4['location'] = data.location.apply(lambda x: 'other' if x in loc_small_10 else x)
data.tail(5)

,area_type,location,size,total_sqft,bath,price
13315,Built-up Area,Whitefield,5 Bedroom,3453,4.0,231.0
13316,Super built-up Area,Richards Town,4 BHK,3600,5.0,400.0
13317,Built-up Area,Raja Rajeshwari Nagar,2 BHK,1141,2.0,60.0
13318,Super built-up Area,Padmanabhanagar,4 BHK,4689,4.0,488.0
13319,Super built-up Area,Doddathoguru,1 BHK,550,1.0,17.0

In [246]:
len(data4.location.unique())

283

Outliers Detection and removal